package messenger.test;

public class _ToDoList {
/*
 * 1. 클라이언트가 채팅서버에 연결하여 쓰레드를 생성하였을 때 쓰레드 리스트에 추가하는 부분.(특히 방 참여 리스트에)
 * 2. 채팅서버쓰레드에서 클라이언트가 종료하여 연결이 끊어졌을때 쓰레드 리스트에서 해당 쓰레드를 제거하는 부분
 * 
 * 3. 이모티콘 시스템
 * 3-1. 이모티콘 이미지들은 서버 db에 저장된다.
 * 3-2. 클라이언트가 접속을 한 다음에 서버에 연결하여 이모티콘 리스트를 요청한다.
 * 3-3. 서버는 그 요청을 받아서 이모티콘 테이블을 전체조회한 다음 각 이미지를  전달한다.
 * 3-4. 클라이언트가 받은 이모티콘 리스트는 프로그램이 종료될때까지 유지된다.
 * 3-5. 클라이언트가 채팅을 전송할때 이모티콘을 입력하면 서버에는 이모티콘의 이미지가 아닌 이름이 전달된다.
 * 3-6. 보낸 클라이언트는 이모티콘을 그대로 화면에 출력한다.
 * 3-7. 서버가 다른 클라이언트에게 전달하고, 메시지를 받은 클라이언트는 메시지를 번역하여 이모티콘 이름이 있으면 이모티콘 이미지로 치환하여 화면에 출력한다.
 */
}
